<h1>第3章 分组<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#1.-SAC过程" data-toc-modified-id="1.-SAC过程-1">1. SAC过程</a></span><ul class="toc-item"><li><span><a href="#1.1-内涵" data-toc-modified-id="1.1-内涵-1.1">1.1 内涵</a></span></li><li><span><a href="#1.2-apply过程" data-toc-modified-id="1.2-apply过程-1.2">1.2 apply过程</a></span></li></ul></li><li><span><a href="#2、groupby函数" data-toc-modified-id="2、groupby函数-2">2、groupby函数</a></span><ul class="toc-item"><li><span><a href="#2.1.-分组函数的基本内容：" data-toc-modified-id="2.1.-分组函数的基本内容：-2.1">2.1. 分组函数的基本内容：</a></span><ul class="toc-item"><li><span><a href="#2.1.1-根据某一列分组" data-toc-modified-id="2.1.1-根据某一列分组-2.1.1">2.1.1 根据某一列分组</a></span></li><li><span><a href="#2.1.2-根据某几列分组" data-toc-modified-id="2.1.2-根据某几列分组-2.1.2">2.1.2 根据某几列分组</a></span></li><li><span><a href="#2.1.3-组容量与组数" data-toc-modified-id="2.1.3-组容量与组数-2.1.3">2.1.3 组容量与组数</a></span></li><li><span><a href="#2.1.4-组的遍历" data-toc-modified-id="2.1.4-组的遍历-2.1.4">2.1.4 组的遍历</a></span></li><li><span><a href="#2.1.5-level参数（用于多级索引）和axis参数" data-toc-modified-id="2.1.5-level参数（用于多级索引）和axis参数-2.1.5">2.1.5 level参数（用于多级索引）和axis参数</a></span></li></ul></li></ul></li></ul></div>

# 第3章 分组

In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('data/table.csv',index_col='ID')
df.head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

## 1. SAC过程
### 1.1 内涵
* SAC指的是分组操作中的split-apply-combine过程
* 其中split指基于某一些规则，将数据拆成若干组，apply是指对每一组独立地使用函数，combine指将每一组的结果组合成某一类数据结构
### 1.2 apply过程
在该过程中，我们实际往往会遇到四类问题：
* 整合（Aggregation）——即分组计算统计量（如求均值、求每组元素个数）
* 变换（Transformation）——即分组对每个单元的数据进行操作（如元素标准化）
* 过滤（Filtration）——即按照某些规则筛选出一些组（如选出组内某一指标小于50的组）
* 综合问题——即前面提及的三种问题的混合
## 2、groupby函数
### 2.1. 分组函数的基本内容：
#### 2.1.1 根据某一列分组

In [2]:
grouped_single = df.groupby('School')

经过groupby后会生成一个groupby对象，该对象本身不会返回任何东西，只有当相应的方法被调用才会起作用

例如取出某一个组：

In [3]:
grouped_single.get_group('S_1').head()

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

#### 2.1.2 根据某几列分组

In [4]:
grouped_mul = df.groupby(['School','Class'])
grouped_mul.get_group(('S_2','C_4'))

     School Class Gender   Address  Height  Weight  Math Physics
ID
2401    S_2   C_4      F  street_2     192      62  45.3       A
2402    S_2   C_4      M  street_7     166      82  48.7       B
2403    S_2   C_4      F  street_6     158      60  59.7      B+
2404    S_2   C_4      F  street_2     160      84  67.7       B
2405    S_2   C_4      F  street_6     193      54  47.6       B

#### 2.1.3 组容量与组数

In [5]:
grouped_single.size()

School
S_1    15
S_2    20
dtype: int64

In [6]:
grouped_mul.size()

School  Class
S_1     C_1      5
        C_2      5
        C_3      5
S_2     C_1      5
        C_2      5
        C_3      5
        C_4      5
dtype: int64

In [7]:
grouped_single.ngroups

2

In [8]:
grouped_mul.ngroups

7

#### 2.1.4 组的遍历

In [9]:
for name,group in grouped_single:
    print(name)
    display(group.head())

S_1

     School Class Gender   Address  Height  Weight  Math Physics
ID
1101    S_1   C_1      M  street_1     173      63  34.0      A+
1102    S_1   C_1      F  street_2     192      73  32.5      B+
1103    S_1   C_1      M  street_2     186      82  87.2      B+
1104    S_1   C_1      F  street_2     167      81  80.4      B-
1105    S_1   C_1      F  street_4     159      64  84.8      B+

S_2

     School Class Gender   Address  Height  Weight  Math Physics
ID
2101    S_2   C_1      M  street_7     174      84  83.3       C
2102    S_2   C_1      F  street_6     161      61  50.6      B+
2103    S_2   C_1      M  street_4     157      61  52.5      B-
2104    S_2   C_1      F  street_5     159      97  72.2      B+
2105    S_2   C_1      M  street_4     170      81  34.2       A

#### 2.1.5 level参数（用于多级索引）和axis参数

In [10]:
df.set_index(['Gender','School']).groupby(level=1,axis=0).get_group('S_1').head()

              Class   Address  Height  Weight  Math Physics
Gender School
M      S_1      C_1  street_1     173      63  34.0      A+
F      S_1      C_1  street_2     192      73  32.5      B+
M      S_1      C_1  street_2     186      82  87.2      B+
F      S_1      C_1  street_2     167      81  80.4      B-
       S_1      C_1  street_4     159      64  84.8      B+